In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01 -1.060122  0.394575 -0.179505 -0.492319
2013-01-02 -0.131221  0.098108  1.336553  1.754897
2013-01-03 -0.628381 -0.265609  0.576818 -0.888120
2013-01-04 -1.599067  0.221237 -1.453806 -0.223346
2013-01-05 -0.346150  0.764857  1.675462 -0.097989
2013-01-06  0.282510  0.469112  0.000309  0.377589

In [12]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1, index=list(range(4)),dtype='float32'),
                   'D' : np.array([3] * 4, dtype = 'int32'),
                   'E' : pd.Categorical(["test","train","test","train"]),
                   'F': 'foo'})

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [17]:
df2.head

<bound method NDFrame.head of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [18]:
df2.tail

<bound method NDFrame.tail of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[-1.06012211e+00,  3.94574789e-01, -1.79504885e-01,
        -4.92319466e-01],
       [-1.31221292e-01,  9.81084229e-02,  1.33655281e+00,
         1.75489725e+00],
       [-6.28380727e-01, -2.65609410e-01,  5.76817581e-01,
        -8.88120029e-01],
       [-1.59906660e+00,  2.21236644e-01, -1.45380603e+00,
        -2.23345732e-01],
       [-3.46150476e-01,  7.64856938e-01,  1.67546229e+00,
        -9.79893558e-02],
       [ 2.82510365e-01,  4.69112424e-01,  3.08860749e-04,
         3.77589307e-01]])

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.580405  0.280380  0.325972  0.071785
std    0.673998  0.351626  1.134416  0.925412
min   -1.599067 -0.265609 -1.453806 -0.888120
25%   -0.952187  0.128890 -0.134551 -0.425076
50%   -0.487266  0.307906  0.288563 -0.160668
75%   -0.184954  0.450478  1.146619  0.258695
max    0.282510  0.764857  1.675462  1.754897

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.060122   -0.131221   -0.628381   -1.599067   -0.346150    0.282510
B    0.394575    0.098108   -0.265609    0.221237    0.764857    0.469112
C   -0.179505    1.336553    0.576818   -1.453806    1.675462    0.000309
D   -0.492319    1.754897   -0.888120   -0.223346   -0.097989    0.377589

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.492319 -0.179505  0.394575 -1.060122
2013-01-02  1.754897  1.336553  0.098108 -0.131221
2013-01-03 -0.888120  0.576818 -0.265609 -0.628381
2013-01-04 -0.223346 -1.453806  0.221237 -1.599067
2013-01-05 -0.097989  1.675462  0.764857 -0.346150
2013-01-06  0.377589  0.000309  0.469112  0.282510

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.628381 -0.265609  0.576818 -0.888120
2013-01-02 -0.131221  0.098108  1.336553  1.754897
2013-01-04 -1.599067  0.221237 -1.453806 -0.223346
2013-01-01 -1.060122  0.394575 -0.179505 -0.492319
2013-01-06  0.282510  0.469112  0.000309  0.377589
2013-01-05 -0.346150  0.764857  1.675462 -0.097989

In [25]:
df['A']

2013-01-01   -1.060122
2013-01-02   -0.131221
2013-01-03   -0.628381
2013-01-04   -1.599067
2013-01-05   -0.346150
2013-01-06    0.282510
Freq: D, Name: A, dtype: float64

In [26]:
df[1:3]

                   A         B         C         D
2013-01-02 -0.131221  0.098108  1.336553  1.754897
2013-01-03 -0.628381 -0.265609  0.576818 -0.888120

In [27]:
df.loc[dates[0]]

A   -1.060122
B    0.394575
C   -0.179505
D   -0.492319
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.060122  0.394575
2013-01-02 -0.131221  0.098108
2013-01-03 -0.628381 -0.265609
2013-01-04 -1.599067  0.221237
2013-01-05 -0.346150  0.764857
2013-01-06  0.282510  0.469112

In [29]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.131221  0.098108
2013-01-03 -0.628381 -0.265609
2013-01-04 -1.599067  0.221237

In [31]:
df.loc['20130102', ['A', 'B']]

A   -0.131221
B    0.098108
Name: 2013-01-02 00:00:00, dtype: float64

In [32]:
df.at[dates[0], 'A']

-1.0601221080598175

In [33]:
df.iloc[3]

A   -1.599067
B    0.221237
C   -1.453806
D   -0.223346
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.599067  0.221237
2013-01-05 -0.346150  0.764857

In [35]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.131221  0.098108  1.336553  1.754897
2013-01-03 -0.628381 -0.265609  0.576818 -0.888120

In [36]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.131221  1.336553
2013-01-03 -0.628381  0.576818
2013-01-05 -0.346150  1.675462

In [37]:
df[df.A > 0]

                  A         B         C         D
2013-01-06  0.28251  0.469112  0.000309  0.377589

In [38]:
df[df > 0]

                  A         B         C         D
2013-01-01      NaN  0.394575       NaN       NaN
2013-01-02      NaN  0.098108  1.336553  1.754897
2013-01-03      NaN       NaN  0.576818       NaN
2013-01-04      NaN  0.221237       NaN       NaN
2013-01-05      NaN  0.764857  1.675462       NaN
2013-01-06  0.28251  0.469112  0.000309  0.377589

In [39]:
df3 = df.copy()

In [40]:
df3['E'] = ['one', 'one','two','three','four','three']

In [41]:
df3

                   A         B         C         D      E
2013-01-01 -1.060122  0.394575 -0.179505 -0.492319    one
2013-01-02 -0.131221  0.098108  1.336553  1.754897    one
2013-01-03 -0.628381 -0.265609  0.576818 -0.888120    two
2013-01-04 -1.599067  0.221237 -1.453806 -0.223346  three
2013-01-05 -0.346150  0.764857  1.675462 -0.097989   four
2013-01-06  0.282510  0.469112  0.000309  0.377589  three

In [42]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [43]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [44]:
df.at[dates[0],'A'] = 0

In [45]:
df.iat[0,1] = 0

In [46]:
df.loc[:,'D'] = np.array([5] * len(df))

In [47]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.179505  5
2013-01-02 -0.131221  0.098108  1.336553  5
2013-01-03 -0.628381 -0.265609  0.576818  5
2013-01-04 -1.599067  0.221237 -1.453806  5
2013-01-05 -0.346150  0.764857  1.675462  5
2013-01-06  0.282510  0.469112  0.000309  5

In [48]:
df2 = df.copy()

In [49]:
df2[df2 > 0] = -df2

In [50]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.179505 -5
2013-01-02 -0.131221 -0.098108 -1.336553 -5
2013-01-03 -0.628381 -0.265609 -0.576818 -5
2013-01-04 -1.599067 -0.221237 -1.453806 -5
2013-01-05 -0.346150 -0.764857 -1.675462 -5
2013-01-06 -0.282510 -0.469112 -0.000309 -5

In [51]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [52]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [53]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.179505  5  1.0
2013-01-02 -0.131221  0.098108  1.336553  5  1.0
2013-01-03 -0.628381 -0.265609  0.576818  5  NaN
2013-01-04 -1.599067  0.221237 -1.453806  5  NaN

In [54]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.179505  5  1.0
2013-01-02 -0.131221  0.098108  1.336553  5  1.0

In [55]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.179505  5  1.0
2013-01-02 -0.131221  0.098108  1.336553  5  1.0
2013-01-03 -0.628381 -0.265609  0.576818  5  5.0
2013-01-04 -1.599067  0.221237 -1.453806  5  5.0

In [56]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [57]:
df.mean()

A   -0.403718
B    0.214618
C    0.325972
D    5.000000
dtype: float64

In [58]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.179505  5
2013-01-02 -0.131221  0.098108  1.336553  5
2013-01-03 -0.628381 -0.265609  0.576818  5
2013-01-04 -1.599067  0.221237 -1.453806  5
2013-01-05 -0.346150  0.764857  1.675462  5
2013-01-06  0.282510  0.469112  0.000309  5

In [59]:
df.mean(1)

2013-01-01    1.205124
2013-01-02    1.575860
2013-01-03    1.170707
2013-01-04    0.542091
2013-01-05    1.773542
2013-01-06    1.437983
Freq: D, dtype: float64

In [60]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [61]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [62]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.628381 -1.265609 -0.423182  4.0
2013-01-04 -4.599067 -2.778763 -4.453806  2.0
2013-01-05 -5.346150 -4.235143 -3.324538  0.0
2013-01-06       NaN       NaN       NaN  NaN